Embedfire-emwin/ebf_stm32f429_tiaozhanzhe_emwin_demo/09. emWin_STDemo_ARGB8888/USER/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  fire
  * @version V1.0
  * @date    2015-xx-xx
  * @brief   用1.5.1版本库建的工程模板
  ******************************************************************************
  * @attention
  *
  * 实验平台:秉火  STM32 F429 开发板 
  * 论坛    :http://www.firebbs.cn
  * 淘宝    :http://firestm32.taobao.com
  *
  ******************************************************************************
  */
#include "stm32f4xx.h"
#include "./Bsp/led/bsp_led.h" 
#include "./Bsp/beep/bsp_beep.h" 
#include "./Bsp/usart/bsp_debug_usart.h"
#include "./Bsp/systick/bsp_SysTick.h"
#include "./Bsp/TouchPad/bsp_touchpad.h"
#include "./Bsp/key/bsp_key.h"
#include "./Bsp/sdram/bsp_sdram.h"
#include "./Bsp/lcd/bsp_lcd.h"
#include "./Bsp/touch/gt9xx.h"
#include "GUI.h"
#include "DIALOG.h"
#include "GUIDEMO.h"

KEY Key1,Key2;



/**
  * @brief  主函数
  * @param  无
  * @retval 无
  */
int main(void)
{
//	static uint8_t count=0;
	/*CRC和emWin没有关系，只是他们为了库的保护而做的，这样STemWin的库只能用在ST的芯片上面，别的芯片是无法使用的。 */
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_CRC, ENABLE);
  
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	
	/* 初始化LED */
	LED_GPIO_Config();
	/* 初始化蜂鸣器 */
	Beep_GPIO_Config();
	Key1_GPIO_Config();
	Key2_GPIO_Config();
	KeyCreate(&Key1,GetPinStateOfKey1);
	KeyCreate(&Key2,GetPinStateOfKey2);
	/* 初始化调试串口，一般为串口1 */
	Debug_USART_Config();
	
	/* 初始化触摸屏 */
	GTP_Init_Panel();	//触摸屏初始化必须优先于系统滴答定时器初始化
	
	/* 初始化系统滴答定时器 */
	SysTick_Init();
	
	TPAD_Init();
	
  /*初始化SDRAM模块*/
  SDRAM_Init();

	/* Init the STemWin GUI Library */
  GUI_Init();
	
  /* Setup layer configuration during startup */
//  GUI_SetBkColor(GUI_TRANSPARENT);
//  GUI_SelectLayer(1);
//  GUI_Clear();
//  GUI_SetBkColor(GUI_TRANSPARENT); 
//  GUI_SelectLayer(0);

	while(1)
	{
		GUIDEMO_Main();
	}
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
